{
  "intents": [
    {"tag": "vacio", "patterns": ["", " ", "   "], "responses": ["Por favor pregunta algo, y no mandes mensajes en blanco ._."]},
    {"tag": "saludo", "patterns": ["Hola", "¿Como estas?", "Saludos"], "responses": ["¡Hola!", "Hola, ¿en que puedo ayudarte?"]},
    {"tag": "despedida", "patterns": ["Adios", "Hasta luego", "Chao"], "responses": ["¡Hasta luego!", "Adios, que tengas un buen dia."]},
    {"tag": "registro", "patterns": ["¿Cómo puedo registrarme en la plataforma?", "Registrarme", "Crear cuenta"], "responses": ["Si eres estudiante,para registrarte ve a la página de inicio y haz clic en 'Registrarse'. Llena el formulario con tu información y sigue las instrucciones para completar el proceso, pero si eres docente la institucion te dara tu usuario y contraseña de por medio de tu correo institucional"]},
    {"tag": "programar_tutoria", "patterns": ["¿Cuál es el proceso para programar una tutoría?", "Programar tutoría", "Agendar tutoria"], "responses": ["Para programar una tutoría, inicia sesión en tu cuenta, ve a la pestaña de agendar y apareceran los horarios disponibles elige un horario que te convenga. Completa la solicitud y ya estas registrado en una tutoria."]},
    {"tag": "editar_perfil", "patterns": ["¿Cómo edito mi perfil de usuario?", "Editar perfil", "Actualizar información"], "responses": ["Puedes editar tu perfil contactando a la institucion o contactando a un administrador. Solo podras modificar en el perfil tu contraseña y foto de perfil Haciendo clic 'Perfil', realiza los cambios necesarios y guarda la información."]},
    {"tag": "disponibilidad_tutores", "patterns": ["¿Dónde puedo ver la disponibilidad de los tutores?", "Disponibilidad de tutores", "Buscar horarios"], "responses": ["La disponibilidad de los tutores se encuentra en el agendar tutorias. Puedes revisarlo dando clic en detalles de la tutoria para encontrar un horario que se ajuste a tus necesidades y alli encontraras informacion sobre el docente, materia y tema."]},
    {"tag": "cancelar_tutoria", "patterns": ["¿Cómo cancelo o reprogramo una tutoría ya agendada?", "Cancelar tutoría", "Cambiar horario"], "responses": ["Puedes cancelar tutoria academica en la seccion 'Tutorias Pendientes' despues de iniciar sesion. Busca la tutoría programada y haz clic en el cancelar."]},
    {"tag": "materias_disponibles", "patterns": ["¿Cuáles son las materias disponibles para tutoría?", "Materias de tutoría", "Temas de estudio"], "responses": ["Ofrecemos tutorías en una amplia gama de materias. En la pestaña 'Agendar tutoria' Puedes ver que materia se va dar dando en el boton de descricion de la tutoria academica, cabe a destacar que las materias son las mismas ofrecidas por la intitucion lo unico es que esto depende de la disponibilidad de la tutoria ofrecida por algun docente"]},
    {"tag": "notificaciones", "patterns": ["¿Cómo funciona el sistema de notificaciones?", "Notificaciones", "Recibir alertas"], "responses": ["El sistema de notificaciones te informará sobre la cancelacion de la tutoria por parte del docente, recuerda que al ser cancelada la tutoria deberas agendar una nueva. Asegúrate de estar pendiente a las notificaciones de cancelacion de tutoria que son enviadas a tu correo institucional."]},
    {"tag": "comunicarse_tutor", "patterns": ["¿Puedo comunicarme con un tutor antes de la tutoría?", "Comunicarse con tutor", "Enviar mensaje previo"], "responses": ["No, actualmente no puedes comunicarte por medio de la plataforma con el tutor antes de la tutoria academica. Pero esta funcionalidad sera agregada a futuro para garantizar una mejor comunicacion entre estudiante y docente "]},
    {"tag": "comentarios", "patterns": ["¿Cómo dejo un comentario después de una tutoría?", "Dejar comentario", "Opinión sobre estudiante"], "responses": ["Si eres un docente, después de cada tutoría, deberas pasar lista de los estudiantes que asistiron dejar un comentario en la sección 'Tutorias pendientes'. Tu retroalimentación es valiosa para mejorar el promedio de los estudiantes."]},
    {"tag": "historial_tutorias", "patterns": ["¿Dónde puedo ver mi historial de tutorías?", "Historial de tutorías", "Registro de sesiones"], "responses": ["Tu historial de tutorías se encuentra en la sección 'Historial' despues de iniciar sesion. Aquí podrás ver un registro completo de todas tus sesiones anteriores."]},
    {"tag": "seguridad_privacidad", "patterns": ["¿Cómo garantizan la seguridad y privacidad de mis datos?", "Seguridad de datos", "Privacidad"], "responses": ["La seguridad y privacidad de tus datos son nuestra prioridad. Puedes obtener más información cuando te registrar en la plataforma, ademas nadie ajeno a la intutucion tendra acceso a tus datos personales."]},
    {"tag": "atencion_cliente", "patterns": ["¿Cuál es el horario de atención al cliente?", "Atención al cliente", "Soporte"], "responses": ["Nuestro equipo de atención al cliente está disponible para ayudarte durante los siguientes horarios: 8 A.M a 5 P.M. de lusnes a viernes de forma precensial en la institucion, si tienes alguna pregunta tambien puedes contactarnos por medio del formulario de 'Tienes alguna pregunta' que esta ubicado en la pagina principal y con mucho gusto tu duda sera respondida."]},
    {"tag": "restablecer_contrasena", "patterns": ["¿Cómo puedo restablecer mi contraseña si la olvido?", "Restablecer contraseña", "Olvidé mi contraseña"], "responses": ["Si olvidaste tu contraseña, ve a la página de inicio de sesión y haz clic en '¿Olvide mi clave?'. Colocas tu correo institucional con el que estas registrado en la plataforma y recibiras tu nueva contraseña por el correo, cabe a destacar que debes cambiar la contraseña una vez iniciada la sesion."]}

  ]
}
