{
  "intents": [
    {"tag": "vacio", "patterns": ["", " ", "   "], "responses": ["Por favor pregunta algo, y no mandes mensajes en blanco ._."]},
    {"tag": "aleatorio", "patterns": ["adadoajdjnfa","hlas123123mj3nhb3", "aaaaaaaaaaaaaaa"], "responses": ["Por favor escribe algo valido"]},    
    {"tag": "saludo", "patterns": ["Hola", "Como estas?", "Saludos"], "responses": ["Hola!", "Hola, en que puedo ayudarte?"]},
    {"tag": "despedida", "patterns": ["Adios", "Hasta luego", "Chao"], "responses": ["Hasta luego!", "Adios, que tengas un buen dia."]},
    {"tag": "registro", "patterns": ["Como puedo registrarme en la plataforma?", "Registrarme", "Crear cuenta"], "responses": ["Si eres estudiante, para registrarte ve a la pagina de inicio y haz clic en 'Registrarse'. Llena el formulario con tu informacion y sigue las instrucciones para completar el proceso, pero si eres docente la institucion te dara tu usuario y clave por medio de tu correo institucional"]},
    {"tag": "programar_tutoria", "patterns": ["Cual es el proceso para programar una tutoria?", "Programar tutoria", "Agendar tutoria"], "responses": ["Para programar una tutoria, inicia sesion en tu cuenta, ve a la ventana agendar y apareceran los horarios disponibles. Elige un horario que te convenga, completa la solicitud y ya estaras registrado en una tutoria."]},
    {"tag": "editar_perfil", "patterns": ["Como edito mi perfil de usuario?", "Editar perfil", "Actualizar informacion"], "responses": ["Puedes editar tu perfil contactando a la institucion o contactando a un administrador. Solo podras modificar en el perfil tu clave y foto de perfil. Haz clic en 'Perfil', realiza los cambios necesarios y guarda la informacion."]},
    {"tag": "disponibilidad_tutores", "patterns": ["Donde puedo ver la disponibilidad de los tutores?", "Disponibilidad de tutores", "Buscar horarios"], "responses": ["La disponibilidad de los tutores se encuentra en el agendar tutorias. Puedes revisarlo dando clic en detalles de la tutoria para encontrar un horario que se ajuste a tus necesidades y allí encontraras informacion sobre el docente, materia y tema."]},
    {"tag": "cancelar_tutoria", "patterns": ["Como cancelo o reprogramo una tutoria ya agendada?", "Cancelar tutoria", "Cambiar horario"], "responses": ["Puedes cancelar tutoria academica en la seccion 'Tutorias Pendientes' despues de iniciar sesion. Busca la tutoria programada y haz clic en el cancelar."]},
    {"tag": "materias_disponibles", "patterns": ["Cuales son las materias disponibles para tutoria?", "Materias de tutoria", "Temas de estudio"], "responses": ["Ofrecemos tutorias en una amplia gama de materias. En la pestaña 'Agendar tutoria' Puedes ver que materia se va a dar dando clic en el boton de descricion de la tutoria academica. Cabe a destacar que las materias son las mismas ofrecidas por la intitucion, lo unico es que esto depende de la disponibilidad de la tutoria ofrecida por algun docente."]},
    {"tag": "notificaciones", "patterns": ["Como funciona el sistema de notificaciones?", "Notificaciones", "Recibir alertas"], "responses": ["El sistema de notificaciones te informara sobre la cancelacion de la tutoria por parte del docente. Recuerda que al ser cancelada la tutoria deberas agendar una nueva. Asegurate de estar pendiente a las notificaciones de cancelacion de tutoria que son enviadas a tu correo institucional."]},
    {"tag": "comunicarse_tutor", "patterns": ["Puedo comunicarme con un tutor antes de la tutoria?", "Comunicarse con tutor", "Enviar mensaje previo"], "responses": ["No, actualmente no puedes comunicarte por medio de la plataforma con el tutor antes de la tutoria academica. Pero esta funcionalidad sera agregada a futuro para garantizar una mejor comunicacion entre estudiante y docente."]},
    {"tag": "comentarios", "patterns": ["Como dejo un comentario despues de una tutoria?", "Dejar comentario", "Opinion sobre estudiante"], "responses": ["Si eres un docente, despues de cada tutoria, deberas pasar lista de los estudiantes que asistiron dejar un comentario en la seccion 'Tutorias pendientes'. Tu retroalimentacion es valiosa para mejorar el promedio de los estudiantes."]},
    {"tag": "historial_tutorias", "patterns": ["Donde puedo ver mi historial de tutorias?", "Historial de tutorias", "Registro de sesiones"], "responses": ["Tu historial de tutorias se encuentra en la seccion 'Historial' despues de iniciar sesion. Aqui podras ver un registro completo de todas tus sesiones anteriores."]},
    {"tag": "seguridad_privacidad", "patterns": ["Como garantizan la seguridad y privacidad de mis datos?", "Seguridad de datos", "Privacidad"], "responses": ["La seguridad y privacidad de tus datos son nuestra prioridad. Puedes obtener mas informacion cuando te registres en la plataforma, ademas, nadie ajeno a la institucion tendra acceso a tus datos personales."]},
    {"tag": "atencion_cliente", "patterns": ["Cual es el horario de atencion al cliente?", "Atencion al cliente", "Soporte"], "responses": ["Nuestro equipo de atencion al cliente esta disponible para ayudarte durante los siguientes horarios: 8 A.M a 5 P.M. de lunes a viernes. Si tienes alguna pregunta, tambien puedes contactarnos por medio del formulario de '¿Tienes alguna pregunta?' que esta ubicado en la pagina principal y con mucho gusto tu duda sera respondida."]},
    {"tag": "restablecer_contrasena", "patterns": ["Como puedo restablecer mi clave si la olvido?", "Restablecer clave", "Olvide mi clave"], "responses": ["Si olvidaste tu clave, ve a la pagina de inicio de sesion y haz clic en '¿Olvide mi clave?'. Coloca tu correo institucional con el que estas registrado en la plataforma y recibiras tu nueva contrasena por el correo. Cabe a destacar que debes cambiar la contrasena una vez iniciada la sesion."]}
  ]
}
